Tekla.Structures.ModelInternal.dotBuildingHierarchyItem_t
Serialization structure for building hierarchy item.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItem_t.aGuid
The guid of the building hierarchy item.

Tekla.Structures.ModelInternal.dotBuildingHierarchyItem_t.aName
Name of the building hierarchy item.